{
  "basic": {
    "name": "Lixin Zhu",
    "email": "lz284@duke.com",
    "linkedin": "https://www.linkedin.com/in/lixin-zhu-9ba085310/",
    "resume": "Resume.pdf"
  },
  "home": {
    "heroSentence": "game engineer, technical graphic artist and software engineer",
    "projects": [
      {
        "name": "Mythos (By BrushBits)",
        "year": "2025",
        "keywords": [ "Unreal Engine 5", "GAS", "C++", "Combat Designer" ],
        "shortDesc": "Built a modular RPG combat system in Unreal Engine 5 using GAS, focusing on precise damage calculation, skill targeting, and scalable architecture.",
        "coverImage": "/projects/Mythos/1.jpg",
        "roles": [ "Game Engineer", "Systems Designer" ],
        "highlights": [
          "Attribute System: Health, Mana, Stamina with max constraints; combat stats (Attack Power, Defense, Crit Chance/Damage); real-time monitoring with delegates",
          "Damage Calculation: Multi-factor formulas with Attack Power, Defense, Crit; modular Execution Calculation for damage and healing",
          "Skill Targeting: Mouse-based range checks, vector math for distance validation, AoE calculations from cursor position",
          "Combat Mechanics: Crit system with configurable multipliers; defense-based damage reduction; modular, extensible skill system. Link: https://github.com/xxsKyrreZLX/GasFrame"
        ],
        "detail": [
          {
            "value": "/projects/Mythos/1.jpg",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "Mythos is a comprehensive RPG combat system built in Unreal Engine 5 using the Gameplay Ability System (GAS). My work in the project focuses on creating a modular, scalable architecture that can handle complex combat scenarios with precise damage calculations and sophisticated skill targeting systems."
          },          
          {
            "value": "/projects/Mythos/4.jpg",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "The attribute system manages core stats including Health, Mana, and Stamina with maximum constraints, plus combat-specific attributes like Attack Power, Defense, Critical Chance, and Critical Damage. All attributes are monitored in real-time using delegate-driven event systems for responsive UI updates and gameplay feedback."
          },
          {
            "value": "/projects/Mythos/MythosGASFrame.png",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "The damage calculation system uses multi-factor formulas incorporating Attack Power, Defense, and Critical mechanics. Built with modular Execution Calculations, it supports both damage and healing effects. The system includes configurable critical multipliers and defense-based damage reduction for balanced combat mechanics."
          },
          {
            "value": "/projects/Mythos/MouseSkillDirection.jpg",
            "type": "image"
          },          
          {
            "type": "paragraph",
            "value": "Skill targeting utilizes mouse-based range checks and vector mathematics for precise distance validation. The system supports Area of Effect (AoE) calculations from cursor position, enabling complex skill interactions. The clean C++ architecture follows Unreal Engine best practices with efficient attribute capture and debug visualization for real-time feedback."
          }
        ]
      },
      {
        "name": "BlackForest (By Venture Games)",
        "year": "2025",
        "keywords": ["Unreal Engine 5", "Multiplayer", "Replication", "C++", "Blueprint"],
        "shortDesc": "Developed a scalable multiplayer survival exploration system in Unreal Engine 5 with robust replication, synced player data systems, and interactive environment integration.",
        "coverImage": "/projects/BlackForest/1.jpg",
        "roles": ["Game Engineer", "Network Systems Designer"],
        "highlights": [
          "Network Architecture: Clean replication patterns for consistent multiplayer sync of player health, hunger, and thirst systems",
          "Interactive World Objects: Harvestable and collectible systems with network-safe replication and HUD integration",
          "HUD Systems: Real-time UI updates on personal and team states using delegates and RepNotify for clarity and responsiveness"
        ],
        "detail": [
          {
            "value": "/projects/BlackForest/1.jpg",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "BlackForest is a multiplayer survival exploration system developed in Unreal Engine 5, focusing on seamless network synchronization and immersive player experience. My work centers on implementing clean, scalable replication architecture, ensuring critical player data remains consistent across all clients while maintaining server authority."
          },
          {
            "value": "/projects/BlackForest/2.jpg",
            "type": "image"
          },
                      {
              "type": "paragraph",
              "value": "BlackForest features a dynamic multiplayer survival experience where players must manage health, hunger, and thirst while exploring a richly interactive environment. Teammates can cooperate to gather resources, share supplies, and overcome environmental challenges together. Collectible food and water sources, as well as other interactive world objects, encourage exploration and teamwork, making every session unique and engaging."
            },
          {
            "value": "/projects/BlackForest/3.jpg",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "Throughout the project, I followed Unreal Engine best practices for multiplayer game architecture, balancing clarity with performance to build a foundation ready for future combat systems, AI, and complex environment interactions. This approach ensures players experience a stable, engaging survival environment whether playing solo or with friends."
          }
        ]
      }, 
      {
        "name": "Pirate Assassin",
        "year": "2024",
        "keywords": [ "Unreal Engine", "Shader" ],
        "shortDesc": "Pirate Assassin is a RPG game features gameplay systems including combat system, skills, animations, quests, and inventory management.",
        "coverImage": "/projects/RPG/cover.png",
        "roles": [ "Developer", "Designer" ],
        "highlights": [
          "The movement system has various basic movements, including running, jumping, wall climbing, and vaulting",
          "The combat system allow the player to engage in melee combat, archery, block attacks with a shield, and perform evasive rolls to dodge incoming attacks.",
          "Inventory system enables players to gather loot through exploration, defeating enemies, or completing quests.",
          "Implemented quest and save system to cope with game data"
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "Pirate Assassin is a RPG game features gameplay systems including combat system, skills, animations, quests, and inventory management. Players engage in battles, explore quests,defeat and assassinate enemies. The project highlights my ability to be a game engineer and designer."
          },
          {
            "value": "/projects/RPG/1.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "I built the level using assets and Unreal Engine’s Landscape System. I sculpted the terrain, added textures, and placed environmental assets like buildings and foliage to create an immersive scene."
          },
          {
            "value": "/projects/RPG/1.png",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "I also added many interesting features like riding and swimming."
          },
          {
            "value": "/projects/RPG/2.png",
            "type": "image"
          }
        ]
      },
      {
        "name": "Rendering & Shader Development",
        "year": "2025",
        "keywords": [ "Shader", "OpenGL", "Rendering Pipeline", "Niagara" ],
        "shortDesc": "Real-time visual effects and material systems created through shader programming and graphics techniques. Includes dynamic surface deformation, particle systems, and procedural material transformations.",
        "coverImage": "/projects/TAWorks/cover.png",
        "roles": [ "Graphics Programmer", "Rendering Engineer" ],
        "highlights": [
          "Real-time height map rendering and render target systems for dynamic surface deformation",
          "Shader-based particle systems and dynamic material blending for smooth visual transitions",
          "Procedural shader effects using masks, noise, UV manipulation, and Fresnel calculations"
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "An interactive snow material that dynamically deforms with footprints by rendering a height map. The system uses a Render Target as a canvas to capture foot patterns via ray tracing and applies them to the snow surface in real time. To handle large scenes, the canvas moves with the character, preserving footprints and fading distant ones. Snow buildup is simulated by blurring footprints, generating a height map to represent depth. Realistic lighting and terrain displacement are achieved using normal maps and Virtual Heightfield Mesh."
          },
          {
            "value": "/projects/TAWorks/SnowField.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "Built a rendering engine from scratch using modern OpenGL 3.3 Core Profile. The engine handles buffer management, custom shader compilation with file parsing, texture loading, and MVP matrix transformations. Implemented with a modular class structure and integrated ImGui for debugging. Source code available at https://github.com/xxsKyrreZLX/OpenGL."
          },
          {
            "value": "/projects/TAWorks/OpenGL.png",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "Created various 2D and 3D shader experiments on Shadertoy using Fragment Shaders. Projects include real-time 3D scenes rendered with Signed Distance Fields (SDF) and Ray Marching, featuring interactive camera controls and realistic lighting. Also explored fractal iterations and procedural generation techniques to create dynamic patterns with neon glow effects. Available at https://www.shadertoy.com/user/xxskyrre."
          },
          {
            "value": "/projects/TAWorks/Shadertoy.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "This effect simulates a natural transformation between two objects. The dynamic material gradually turns the original object red before fading it out, while a Niagara particle stream flows from the original object to the target, visually linking the transformation. As the particles reach the target, a new object appears, creating a smooth and immersive morphing effect."
          },
          {
            "value": "/projects/TAWorks/DissolveShowup.mp4",
            "type": "video"
          },
          {
            "value": "I created dynamic materials to simulate transformations like freezing and melting transformations. By adding masks, noise, UV manipulation and special techniques like Fresnel highlights to a base texture to add depth and realism to the material.",
            "type": "paragraph"
          },
          {
            "value": "/projects/TAWorks/Fire and frozen.mp4",
            "type": "video"
          }
        ]
      },
      {
        "name": "Working for Multimeida Project Studio(MPS)",
        "year": "2025",
        "keywords": [
          "Part time",
          "XR Developer",
          "Game Developer"
        ],
        "shortDesc": "The MPS Studio is Duke's home for developing and experiencing Virtual Reality (VR), and Augmented Reality (AR). As an XR Game Developer, I actively contribute to VR game projects with a focus on both development and deployment across various platforms.",
        "coverImage": "/projects/MPS/0.jpeg",
        "roles": [ "XR Developer", "Game Developer" ],
        "highlights": [
          "Designed skill data structures and event broadcasting using C++.",
          "Implemented core combat logic, including ability activation and logic (GA), attribute management and modifications (GE) and presentation elements such as visual effects and sound effects(GC).",
          "Developed interaction rules such as combo execution, ability interruptions, and skill dependencies through tag tree.",
          "Implemented cooldown systems, energy/mana consumption, and regeneration mechanics."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "Deployment & Quality Assurance: Implement features and perform QA tasks for VR games, including debugging, plugin/engine upgrades, and cross-platform performance testing. Build and deploy VR projects on Windows (HTC Vive) and Android (Meta Quest), ensuring optimization and stability."
          },
          {
            "value": "/projects/MPS/4.jpeg",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "Game development isn't just about building mechanics in an engine—it's about sharing experiences and engaging with a passionate community. We just had an amazing showcase featuring VR games created by students at Duke. I was thrilled to be part of this event, contributing to the QA and debugging, building and preparing process to ensure a smooth and immersive experience for every guest. Really glad to meet everyone who came and to all developers. I'm proud to be part of a community that shares a love for games."
          },
          {
            "value": "/projects/MPS/2.jpeg",
            "type": "image"
          }
        ]
      },
      {
        "name": "Sky Arena – Combat Demo for Thali",
        "year": "2025",
        "keywords": [ "Unreal Engine", "Gameplay Ability System" ],
        "shortDesc": "Sky Arena showcases the combat system of Thali, a third-person RPG. Built using Unreal Engine’s Gameplay Ability System, it delivers a robust and dynamic combat experience.",
        "coverImage": "/projects/SkyArena/cover.png",
        "roles": [ "Developer", "Designer" ],
        "highlights": [
          "Designed skill data structures and event broadcasting using C++.",
          "Implemented core combat logic, including ability activation and logic (GA), attribute management and modifications (GE) and presentation elements such as visual effects and sound effects(GC).",
          "Developed interaction rules such as combo execution, ability interruptions, and skill dependencies through tag tree.",
          "Implemented cooldown systems, energy/mana consumption, and regeneration mechanics."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "Thali is a fantasy RPG that showcases the bond between the player and their dragon through its combat system. As the tech lead of the studio,I focus on building the combat system using Unreal Engine's Gameplay Ability System. This demo features Shinbi from Paragon as the character model."
          },
          {
            "value": "/projects/SkyArena/General.png",
            "type": "image"
          },
          {
            "type": "paragraph",
            "value": "The combo system in Thali is built using Unreal Engine’s Gameplay Ability System (GAS), with each attack phase represented by a separate ability. During each phase, a timing window allows the player to chain into the next attack. If the player misses the input or gets interrupted, the system ensures a proper reset, so the next attack starts from the first phase."
          },
          {
            "value": "/projects/SkyArena/combo.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "Interruption feature: a character will react and be interrupted when attacked during an action. When a skill is interrupted, it properly ends to prevent the character from entering an abnormal state."
          },
          {
            "value": "/projects/SkyArena/interruption.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "Sample skill: Dash. Dash is a fast-movement ability where the actor moves at high speed, passing through targets while applying effects to hit characters."
          },
          {
            "value": "/projects/SkyArena/dash.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "More skills and features in coming..."
          }
        ]
      },
      {
        "name": "Collision Star",
        "year": "2023",
        "keywords": [ "Unity" ],
        "shortDesc": "Collision Star is a 2D Unity multiplayer game blending strategy and physics. Two players can collaborate or compete by modifying the environment and using reverse-drag mechanics to move players' planets.",
        "coverImage": "/projects/CollisionStar/cover.png",
        "roles": [ "Developer", "Designer" ],
        "highlights": [
          "Players navigate obstacles, collect points, and compete using reverse drag-and-drop physics system.",
          "Players can continuously alter the game environment and interact with them and the other player.",
          "Iterative improvements based on player feedback to enhance gameplay and UI system."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "Collision Star is a 2D Unity multiplayer game blending strategy and physics. Two players can collaborate or compete by modifying the environment and using reverse-drag mechanics to move players' planets. Players score points by colliding with objects, collecting items, and outwitting opponents while avoiding hazards like black holes and teleporters. Random power-ups and dynamic gameplay ensure a fun and competitive experience. Avaliable at https://github.com/xxsKyrreZLX/CollisionStar."
          },
          {
            "value": "/projects/CollisionStar/CollisonStar.mp4",
            "type": "video"
          }
        ]
      },
      {
        "name": "Perfect World",
        "year": "2023",
        "keywords": [ "Unity", "Web Design" ],
        "shortDesc": "During my internship at Perfect World, I developed a placement and inspection system in Unity,allowing interactive weapon positioning and lighting adjustments.I also built responsive web pages using Vue 2, designing leaderboards and data search features to enhance user interaction.",
        "coverImage": "/projects/PW/PWE1.jpg",
        "roles": [ "Technical Development Intern" ],
        "highlights": [
          "Hands-on experience in both game engine development and web technologies.",
          "Working on real-world projects that required close collaboration with a professional team in game company",
          "Honed my ability to address practical development challenges,workflows and deliver solutions to real production needs",
          "Learnt from experienced engineers and experts."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "I Utilized the Unity engine to design a firearm placement and inspection system in the Perfect World Esport (CS:GO). Implemented a virtual joystick and viewpoint control, enabling users to modify weapon positions and adjust lighting color tones interactively."
          },
          {
            "value": "/projects/PW/PWWeapon.jpg",
            "type": "image"
          },
          {
            "value": "I Built associated web pages using the Vue 2 framework, with Flexible Box for responsive and structured design in the Perfect World Esport (CS:GO). Developed features including leaderboards and data search functionalities for enhanced user interaction. Product link:https://pvp.wanmei.com/",
            "type": "paragraph"
          },
          {
            "value": "/projects/PW/PWE2.png",
            "type": "image"
          }
        ]
      },
      {
        "name": "CodeTutor",
        "year": "2024",
        "keywords": [ "Web Design", "Code Analyze", "Visualization" ],
        "shortDesc": "A code visualization platform designed to enhance the learning and teaching experience for programers. It supports visualization of data structures, providing an intuitive way to understand how various data structures evolve during code execution. It also includes integrated video conferencing capabilities so that learners can get help from others.",
        "coverImage": "/projects/CodeTutor/Cover.png",
        "roles": [ "Web Design", "Frontend Development" ],
        "highlights": [
          "Supports real-time visualization of various kinds of data structures.",
          "Provides an engaging way for programmers to see code behavior dynamically, making complex concepts easier to grasp.",
          "Has real time communicating functions including voice and video chat and screen share."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "CodeTutor is a code visualization platform designed to enhance the learning and teaching experience for programers. It supports visualization of data structures, providing an intuitive way to understand how various data structures evolve during code execution. It also includes integrated video conferencing capabilities so that learners can get help from others."
          },
          {
            "value": "/projects/CodeTutor/CodeTutor.mp4",
            "type": "video"
          },
          {
            "type": "paragraph",
            "value": "Basic structure module supports real-time visualization of various kinds of data structures to help learners understand how they evolve step by step.."
          },
          {
            "value": "/projects/CodeTutor/1.png",
            "type": "image"
          },
          {
            "value": "Running code module provides an engaging way for programmers to see code behavior dynamically when it is running, making complex concepts easier to grasp.",
            "type": "paragraph"
          },
          {
            "value": "/projects/CodeTutor/2.png",
            "type": "image"
          },
          {
            "value": "QA module allows learners to collaborate and seek help from instructors or peers within the platform through voice chat and screen share.",
            "type": "paragraph"
          },
          {
            "value": "/projects/CodeTutor/3.png",
            "type": "image"
          }
        ]
      },
      {
        "name": "Aiur Art Trading Website",
        "year": "2022",
        "keywords": [ "Web Design" ],
        "shortDesc": "The Aiur Art Trading Website is a platform with both front-end and back-end functionalities. Users can manage their accounts, search by name, author, popularity, or rating, comment, buy, upload products, and view browsing history. The platform also have many features like secure password salting, dynamic password strength indicators, and responsive design.",
        "coverImage": "/projects/ArtPlatform/image1.png",
        "roles": [ "Frontend and Backend Development" ],
        "highlights": [
          "Developed using pure HTML, CSS, JavaScript, PHP, and SQL, without relying on frameworks. Getting Hands-on experience in fundamental web technologies.",
          "Supports account management, advanced search, product uploads, purchases, comments, and browsing history tracking for a seamless user experience.",
          "Enhanced front-end features such as product detail magnification, real-time password strength hints, and smooth scrolling windows for an improved user experience.",
          "Password salting, secure authentication, and dynamic password strength indicators."
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "The Aiur Art Trading Website is a platform with both front-end and back-end functionalities. Users can manage their accounts, search by name, author, popularity, or rating, comment, buy, upload products, and view browsing history. The platform also have many features like secure password salting, dynamic password strength indicators, and responsive design."
          },
          {
            "value": "/projects/ArtPlatform/image1.png",
            "type": "image"
          },
          {
            "value": "/projects/ArtPlatform/image1.png",
            "type": "image"
          },
          {
            "value": "/projects/ArtPlatform/image1.png",
            "type": "image"
          }
        ]
      }
    ],
    "skills": [
      {
        "group": "Skills",
        "skills": [
          "Programming Languages: C/C++, C#, Cuda, PHP, SQL",
          "Game Engines: Unreal Engine, Unity",
          "Tools/Frameworks: Git, P4V, Vue, SpringBoot"
        ]
      },
      {
        "group": "Creative Skills",
        "skills": [
          "Technical Design: Niagara, VFX",
          "Web Design: JavaScript,Vue ",
          "Graphics Programming: WebGL"
        ]
      },
      {
        "group": "Soft Skills",
        "skills": [
          "Team Collaboration: Agile Methodologies, Jira",
          "Problem Solving: Analytical Thinking, Debugging",
          "Communication: Documentation, Presentation"
        ]
      }
    ],
    "bio": "I am deeply interested in game engineering and technical artistry, as I enjoy crafting immersive experiences through innovative mechanics, optimized systems, and compelling visual effects. Whether developing robust gameplay logic or pushing technical boundaries, I am eager to contribute my skills and creativity to build outstanding gaming experiences.",
    "bioPic": "/Lixin Zhu.jpg"
  }
}
